RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_sflash.c
        if (cnt > 20000 * 3) {
            return ERROR;
        }
    }

    stat = SFlash_Read_Reg_With_Cmd(pFlashCfg, rCmd, (uint8_t *)&tempVal, 1);

    if (SUCCESS != stat) {
        stat = ERROR;
    }

    if (((tempVal >> bitPos) & 0x01) > 0) {
        return SUCCESS;
    }

    tempVal |= (uint32_t)(1 << bitPos);
    stat = SFlash_Write_Enable(pFlashCfg);

    if (SUCCESS != stat) {
        stat = ERROR;
    }

    stat = SFlash_Write_Reg_With_Cmd(pFlashCfg, wCmd, (uint8_t *)&tempVal, 1);

    if (SUCCESS != stat) {
        return stat;
    }

    while (SET == SFlash_Busy(pFlashCfg)) {
        arch_delay_us(500);
        cnt++;

        if (cnt > 20000 * 3) {
            return ERROR;
        }
    }

    stat = SFlash_Read_Reg_With_Cmd(pFlashCfg, rCmd, (uint8_t *)&tempVal, 1);

    if (SUCCESS != stat) {
        stat = ERROR;
    }

    if (((tempVal >> bitPos) & 0x01) <= 0) {
        return ERROR;
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Erase flash security register one block
 *
 * @param  pFlashCfg: Flash configuration pointer
 * @param  pSecRegCfg: Security register configuration pointer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION SFlash_Erase_Security_Register(SPI_Flash_Cfg_Type *pFlashCfg, SFlash_Sec_Reg_Cfg *pSecRegCfg)
{
    uint32_t cnt = 0;
    uint8_t cmd = 0;
    uint8_t secOptMode = 0;
    uint32_t timeOut = 0;
    SF_Ctrl_Cmd_Cfg_Type flashCmd;

    if (pSecRegCfg->enterSecOptCmd != 0x00) {
        secOptMode = 1;

        if (((uint32_t)(uintptr_t)&flashCmd) % 4 == 0) {
            arch_memset4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
        } else {
            arch_memset(&flashCmd, 0, sizeof(flashCmd));
        }

        flashCmd.cmdBuf[0] = (pSecRegCfg->enterSecOptCmd << 24);
        flashCmd.rwFlag = SF_CTRL_WRITE;
        SF_Ctrl_SendCmd(&flashCmd);

        timeOut = SFCTRL_BUSY_STATE_TIMEOUT;

        while (SET == SF_Ctrl_GetBusyState()) {
            timeOut--;

            if (timeOut == 0) {
                return TIMEOUT;
            }
        }
    }

    BL_Err_Type stat = SFlash_Write_Enable(pFlashCfg);

    if (stat != SUCCESS) {
        return stat;
    }

    if (((uint32_t)(uintptr_t)&flashCmd) % 4 == 0) {
        arch_memset4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
    } else {
        arch_memset(&flashCmd, 0, sizeof(flashCmd));
    }

    cmd = pSecRegCfg->eraseCmd;
    flashCmd.cmdBuf[0] = (cmd << 24) | (pSecRegCfg->blockNum << 12);
    /* rwFlag don't care */
    flashCmd.rwFlag = SF_CTRL_READ;
    flashCmd.addrSize = 3;

    SF_Ctrl_SendCmd(&flashCmd);

    while (SET == SFlash_Busy(pFlashCfg)) {
        arch_delay_us(500);
        cnt++;

        if (cnt > pFlashCfg->timeEsector * 3) {
            return ERROR;
        }
    }

    if (secOptMode > 0) {
        if (((uint32_t)(uintptr_t)&flashCmd) % 4 == 0) {
            arch_memset4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
        } else {
            arch_memset(&flashCmd, 0, sizeof(flashCmd));
        }

        flashCmd.cmdBuf[0] = (pSecRegCfg->exitSecOptCmd << 24);
        flashCmd.rwFlag = SF_CTRL_WRITE;
        SF_Ctrl_SendCmd(&flashCmd);

        timeOut = SFCTRL_BUSY_STATE_TIMEOUT;

        while (SET == SF_Ctrl_GetBusyState()) {
            timeOut--;

            if (timeOut == 0) {
                return TIMEOUT;
            }
        }
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Program flash security register one block
 *
 * @param  pFlashCfg: Flash configuration pointer
 * @param  pSecRegCfg: Security register configuration pointer
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type ATTR_TCM_SECTION SFlash_Program_Security_Register(SPI_Flash_Cfg_Type *pFlashCfg, SFlash_Sec_Reg_Cfg *pSecRegCfg)
{
    uint8_t *const flashCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
    uint32_t i = 0, curLen = 0;
    uint32_t cnt = 0;
    BL_Err_Type stat;
    uint8_t cmd;
    uint8_t secOptMode = 0;
    uint8_t *data = pSecRegCfg->data;
    uint32_t addr = pSecRegCfg->addr;
    uint32_t len = pSecRegCfg->len;
    uint32_t currentAddr = 0;
    uint32_t timeOut = 0;
    SF_Ctrl_Cmd_Cfg_Type flashCmd;

    if (pSecRegCfg->enterSecOptCmd != 0x00) {
        secOptMode = 1;

        if (((uint32_t)(uintptr_t)&flashCmd) % 4 == 0) {
            arch_memset4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
        } else {
            arch_memset(&flashCmd, 0, sizeof(flashCmd));
        }

        flashCmd.cmdBuf[0] = (pSecRegCfg->enterSecOptCmd << 24);
        flashCmd.rwFlag = SF_CTRL_WRITE;
        SF_Ctrl_SendCmd(&flashCmd);

        timeOut = SFCTRL_BUSY_STATE_TIMEOUT;

        while (SET == SF_Ctrl_GetBusyState()) {
            timeOut--;

            if (timeOut == 0) {
                return TIMEOUT;
            }
        }
    }

    if (((uint32_t)(uintptr_t)&flashCmd) % 4 == 0) {
        arch_memset4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
    } else {
        arch_memset(&flashCmd, 0, sizeof(flashCmd));
    }

    /* Prepare command */
    flashCmd.rwFlag = SF_CTRL_WRITE;
    flashCmd.addrSize = 3;
    cmd = pSecRegCfg->programCmd;

    for (i = 0; i < len;) {
        /* Write enable is needed for every program */
        stat = SFlash_Write_Enable(pFlashCfg);

        if (stat != SUCCESS) {
            return stat;
        }

        /* Get current programmed length within page size */
        curLen = 256 - addr % 256;

        if (curLen > len - i) {
            curLen = len - i;
        }

        currentAddr = (pSecRegCfg->blockNum << 12) | addr;

        /* Prepare command */
        arch_memcpy_fast(flashCtrlBuf, data, curLen);
        flashCmd.cmdBuf[0] = (cmd << 24) | (currentAddr);
        flashCmd.nbData = curLen;

